src/DataProcessors/рдв_АРМИнтеграции/рдв_АРМИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рдв_АРМИнтеграции</name>
</mdclass:DataProcessor>

src/InformationRegisters/рдв_СообщенияИнтеграции/рдв_СообщенияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_СообщенияИнтеграции</name>
  <resources>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <type>
      <types>EnumRef.рдв_НаправленияСообщенийИнтеграции</types>
    </type>
  </resources>
  <attributes>
    <name>АдресМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.рдв_СтатусыОбработкиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоЧаса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/рдв_СтатусыОбработкиСообщений/рдв_СтатусыОбработкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СтатусыОбработкиСообщений</name>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/рдв_АРМИнтеграции/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеФормы", 0.1, Истина);
	Элементы.ГруппаРазделы.Видимость = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОтключитьОбработчикОжидания("ОбновитьДанныеФормы");

КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастройкиФормы = Настройки.Получить("НастройкиФормы");
	НастройкиФормы = НастройкиФормы(ЭтотОбъект);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаНажатие(Элемент)
	
	ДанныеПереходаГиперСсылки = ДанныеПереходаГиперСсылки(элемент.Имя);
	
	Если ДанныеПереходаГиперСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ДанныеПереходаГиперСсылки.ИмяФормы, ДанныеПереходаГиперСсылки.Параметры, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОтключитьОбработчикОжидания("ОбновитьДанныеФормы");
	ПодключитьОбработчикОжидания("ОбновитьДанныеФормы", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура КомандаНастроить(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеОкнаНастроекФормы", ЭтотОбъект);
	НастройкиПараметры = Новый Структура("НастройкиФормы", НастройкиФормы(ЭтотОбъект));
	ОткрытьФорму("Обработка.рдв_АРМИнтеграции.Форма.Настройка", НастройкиПараметры, ЭтотОбъект, УникальныйИдентификатор,
																								,, ОповещениеОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отправка

&НаСервере
Процедура ОтправкаОбновить(Данные)
	
	ОчередьРегистрации = Данные.Регистрация;
	ПоСтатусам = Данные.ПоСтатусам;
	
	// Данные регистрации.
	
	КоличествоВсего = ОчередьРегистрации.Итог("Количество");
	Если КоличествоВсего = 0 Тогда
		Элементы.ОтправкаИсходящаяОчередьВсего.Заголовок = "<нет>";
	Иначе
		Элементы.ОтправкаИсходящаяОчередьВсего.Заголовок = СтрШаблон("Всего (%1)", ОчередьРегистрации.Итог("Количество"));
	КонецЕсли;
	
	ГруппаПоВидамСообщений = Элементы.ГруппаОтправкаРегистрацияИзмененийВидыСообщений;
	ОчиститьПодчиненныеЭлементы(ГруппаПоВидамСообщений);
	ИмяФормыОткрытия = "РегистрСведений.рдв_РегистрацияИзменений.ФормаСписка";
	Для Каждого Стр Из ОчередьРегистрации Цикл
		ДобавитьИнформациюПоВидуСообщения(Стр, ГруппаПоВидамСообщений, ИмяФормыОткрытия);
	КонецЦикла;
	
	// Исходящая очередь. Данные по статусам и видам сообщений.
	ИмяФормыОткрытия = "РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка";
	
	Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее;
	ЗаполнитьДанныеФормыПоСтатусам(ПоСтатусам, ИмяФормыОткрытия, Направление);
	
КонецПроцедуры

&НаСервере
Функция ИмяПеречисленияСтатусаОбработки(Перечисление)
	
	Индекс = Перечисления.рдв_СтатусыОбработкиСообщений.Индекс(Перечисление);
	ИмяПеречисления = Перечисления.рдв_СтатусыОбработкиСообщений.КОбработке.Метаданные().ЗначенияПеречисления[Индекс].Имя;
	
	Возврат ИмяПеречисления
	
КонецФункции

&НаСервере
Процедура ДобавитьИнформациюПоВидуСообщения(Запись, Родитель, ИмяФормыОткрытия)
	
	//УникальныйИдентификаторПоля = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_");
	//НоваяГруппа = рдв_РаботаСФормами.ДобавитьГруппу(ЭтотОбъект, "Группа"+Запись.ВидСообщения+УникальныйИдентификаторПоля,,,Родитель,,,Ложь,ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);      
	//НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	//Отступ = рдв_РаботаСФормами.ДобавитьПолеНадписи(ЭтотОбъект, "Отступ"+Запись.ВидСообщения+УникальныйИдентификаторПоля, "", НоваяГруппа);
	//Отступ.Ширина = 2;
	НоваяГруппа = Родитель;
	
	НовыйЭлемент = ДобавитьЭлементНаФорму(Запись, НоваяГруппа);
	
	ОтборФормы = Новый Структура;
	ОтборФормы.Вставить("ВидСообщения", Запись.ВидСообщения);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "Направление") Тогда
		ОтборФормы.Вставить("Направление", Запись.Направление);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "СтатусОбработки") Тогда
		ОтборФормы.Вставить("СтатусОбработки", Запись.СтатусОбработки);
	КонецЕсли;
	
	
	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "ДатаРегистрацииМс") Тогда
	//	НастройкиОтр
	//	
	//	ОтборФормы.Вставить("ДатаРегистрацииМс", НастройкиФормы.ДатаНачалаМс);
	//КонецЕсли;
	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "ДатаРегистрацииВМиллисекундах") Тогда
	//	ОтборФормы.Вставить("ДатаРегистрацииВМиллисекундах", Запись.ДатаНачалаМс);
	//КонецЕсли;
	
	ДобавитьДанныеОткрытияФормы(НовыйЭлемент.Имя, ИмяФормыОткрытия, ОтборФормы);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПодчиненныеЭлементы(Элемент)
	
	Всего = Элемент.ПодчиненныеЭлементы.Количество()-1;
	Для а = 0 По Всего Цикл
		Элементы.Удалить(Элемент.ПодчиненныеЭлементы[Всего-а]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Получение

&НаСервере
Процедура ПолучениеОбновить(Данные)
	
	//Очередь = Данные.Очередь;
	ПоСтатусам = Данные.ПоСтатусам;
	
	// Исходящая очередь. Данные по статусам и видам сообщений.
	ИмяФормыОткрытия = "РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка";
	
	Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее;
	ЗаполнитьДанныеФормыПоСтатусам(ПоСтатусам, ИмяФормыОткрытия, Направление);
	
КонецПроцедуры

#КонецОбласти

#Область Ошибки

&НаСервере
Процедура ОшибкиОбновить(Ошибки)
	
	ВсегоОшибок = 0;
	Родитель = Элементы.ГруппаОшибкиВидыСообщений;
	ОчиститьПодчиненныеЭлементы(Родитель);
	
	Настройки = НастройкиФормы(ЭтотОбъект);
	ВыводитьДанныеЗаПоследниеМинут = Настройки.ВыводитьДанныеЗаПоследниеМинут;
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	Для Каждого СтрокаВидыСообщений Из Ошибки.Строки Цикл
		
		ВсегоОшибок = ВсегоОшибок + СтрокаВидыСообщений.Количество;
		
		МассивИдентификаторов = Новый Массив(СтрокаВидыСообщений.Строки.Количество());
		Для Индекс = 0 По СтрокаВидыСообщений.Строки.Количество()-1 Цикл
			Детальные = СтрокаВидыСообщений.Строки[0];
			МассивИдентификаторов[Индекс] = Детальные.ИдентификаторСообщения;
		КонецЦикла;
		
		НовыйЭлемент = ДобавитьЭлементНаФорму(СтрокаВидыСообщений, Родитель);
		
		НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
		ЭлементОтбораОрганизация = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбораОрганизация.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОшибки");
	    ЭлементОтбораОрганизация.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	    ЭлементОтбораОрганизация.ПравоеЗначение = ТекущаяДатаСеанса-ВыводитьДанныеЗаПоследниеМинут*60;
	    ЭлементОтбораОрганизация.Использование = Истина;
	    
	    ЭлементОтбораОрганизация = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбораОрганизация.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторСообщения");
	    ЭлементОтбораОрганизация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбораОрганизация.ПравоеЗначение = МассивИдентификаторов;
	    ЭлементОтбораОрганизация.Использование = Истина;
	    
	    ЭлементОтбораОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ДобавитьДанныеОткрытияФормы(НовыйЭлемент.Имя,
								"РегистрСведений.рдв_ОшибкиИнтеграции.ФормаСписка",
								, НастройкиОткрытия);
		
	КонецЦикла;
	
	Если ВсегоОшибок = 0 Тогда
		Элементы.ОшибкиВсего.Заголовок = "<нет>";
	Иначе
		Элементы.ОшибкиВсего.Заголовок = СтрШаблон("Всего: %1", ВсегоОшибок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Гиперссылки

&НаСервере
Функция ДанныеПереходаГиперСсылки(ЭлементИмя)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяЭлемента", ЭлементИмя);
	Записи = ДанныеОткрытияФормы.НайтиСтроки(Отбор);
	
	Если Записи.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяФормы", Записи[0].ИмяФормы);
	Результат.Вставить("Параметры", Записи[0].ПараметрыОткрытияФормы);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПостоянныеДанныеПереходаПоГиперСсылкам()
	
	ДанныеОткрытияФормы.Очистить();
	
	// Регистрация изменений
	ДобавитьДанныеОткрытияФормы(Элементы.ОтправкаИсходящаяОчередьВсего.Имя,
								"РегистрСведений.рдв_РегистрацияИзменений.ФормаСписка");
								
	
	// Исходящие сообщения
    // Обработано
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.Обработано;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;
	
	ДобавитьДанныеОткрытияФормы(Элементы.ИсходящиеСообщенияОбработаноВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);
	

								
 	// Исходящие сообщения
  	// КОбработке
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.КОбработке;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;

	ДобавитьДанныеОткрытияФормы(Элементы.ИсходящиеСообщенияКОбработкеВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);


 	// Исходящие сообщения
  	// Ошибка
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.Ошибка;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;
	
	ДобавитьДанныеОткрытияФормы(Элементы.ИсходящиеСообщенияОшибкаВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);
								
	

	// Входящие сообщения
    // Обработано
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.Обработано;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;
	
	ДобавитьДанныеОткрытияФормы(Элементы.ВходящиеСообщенияОбработаноВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);
	
	// Входящие сообщения
  	// КОбработке
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.КОбработке;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;
	
	ДобавитьДанныеОткрытияФормы(Элементы.ВходящиеСообщенияКОбработкеВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);


 	// Входящие сообщения
  	// Ошибка
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусОбработки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_СтатусыОбработкиСообщений.Ошибка;
	ЭлементОтбора.Использование = Истина;

	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Направление");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаРегистрацииМс");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = НастройкиФормы.ДатаНачалаМс;
	ЭлементОтбора.Использование = Истина;
	
	ДобавитьДанныеОткрытияФормы(Элементы.ВходящиеСообщенияОшибкаВсего.Имя,
								"РегистрСведений.рдв_СообщенияИнтеграции.ФормаСписка",,
								НастройкиОткрытия);
								
								
								
	// Ошибки
	НастройкиОткрытия = Новый НастройкиКомпоновкиДанных;
	ЭлементОтбора = НастройкиОткрытия.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОшибки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса()-86400*4;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ДобавитьДанныеОткрытияФормы(Элементы.ОшибкиВсего.Имя,
								"РегистрСведений.рдв_ОшибкиИнтеграции.ФормаСписка",,
								НастройкиОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеОткрытияФормы(ИмяЭлемента, ИмяФормыОткрытия, ОтборОткрытия=Неопределено, ФиксированныеНастройки=Неопределено)
	
	НоваяЗапись = ДанныеОткрытияФормы.Добавить();
	НоваяЗапись.ИмяЭлемента = ИмяЭлемента;
	НоваяЗапись.ИмяФормы = ИмяФормыОткрытия;
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	Если Не ОтборОткрытия = Неопределено Тогда
		ПараметрыОткрытияФормы.Вставить("Отбор", ОтборОткрытия);
	КонецЕсли;
	
	Если Не ФиксированныеНастройки = Неопределено Тогда
		ПараметрыОткрытияФормы.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	КонецЕсли;

	НоваяЗапись.ПараметрыОткрытияФормы = ПараметрыОткрытияФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновитьФорму

&НаКлиенте
Процедура ОбновитьДанныеФормы()
	
	Элементы.ГруппаДлительнаяОперация.Видимость = Истина;
	
	ДлительнаяОперация = ВыполнитьОбновитьДанныеФормыНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОбновлениеФормы", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьОбновитьДанныеФормыНаСервере()
	
	Настройки = НастройкиФормы(ЭтотОбъект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.рдв_АРМИнтеграции.ОбновитьДанные"
												, Настройки.ВыводитьДанныеЗаПоследниеМинут);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОбновлениеФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ГруппаДлительнаяОперация.Видимость = Ложь;
	
	Если Результат = Неопределено Тогда
		ВключитьАвтообновлениеФормы();
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВключитьАвтообновлениеФормы();
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы(Результат.АдресРезультата);
	
	ВключитьАвтообновлениеФормы();
	
	Если Не Элементы.ГруппаРазделы.Видимость Тогда
		Элементы.ГруппаРазделы.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(АдресДанныхФормы)
	
	Попытка
		ДанныеФормы = ПолучитьИзВременногоХранилища(АдресДанныхФормы);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(СтрШаблон("Не удалось получить данные по причине: %1"
								, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат;
	КонецПопытки;
	
	ЗаполнитьПостоянныеДанныеПереходаПоГиперСсылкам();
	ВнешниеСистемыОбновить(ДанныеФормы.ВнешниеСистемы);
	ОтправкаОбновить(ДанныеФормы.Отправка);
	ПолучениеОбновить(ДанныеФормы.Получение);
	ОшибкиОбновить(ДанныеФормы.Ошибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьАвтообновлениеФормы()
	
	Настройки = НастройкиФормы(ЭтотОбъект);
	
	Если Настройки.ИспользоватьАвтообновление = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОбновления = Настройки.ПериодОбновления;
	ПодключитьОбработчикОжидания("ОбновитьДанныеФормы", ПериодОбновления, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ВнешниеСистемы
	
&НаСервере
Процедура ВнешниеСистемыОбновить(Данные)
	
	ВнешниеСистемы.Загрузить(Данные);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДанныеФормыПоСтатусам(ПоСтатусам, ИмяФормыОткрытия, Направление)
	

	Если Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Исходящее Тогда
		
		ГруппаОбработано = Элементы.ГруппаИсходящиеСообщенияОбработаноВидыСообщений;
		ГруппаКОбработке = Элементы.ГруппаИсходящиеСообщенияКОбработкеВидыСообщений;
		ГруппаОшибка = Элементы.ГруппаИсходящиеСообщенияОшибкаВидыСообщений;
		ЭлементОбработаноВсего = Элементы.ИсходящиеСообщенияОбработаноВсего;
		ЭлементКОбработкеВсего = Элементы.ИсходящиеСообщенияКОбработкеВсего;
		ЭлементОшибкаВсего = Элементы.ИсходящиеСообщенияОшибкаВсего;
		
	ИначеЕсли Направление = Перечисления.рдв_НаправленияСообщенийИнтеграции.Входящее Тогда
		
		ГруппаОбработано = Элементы.ГруппаВходящиеСообщенияОбработаноВидыСообщений;
		ГруппаКОбработке = Элементы.ГруппаВходящиеСообщенияКОбработкеВидыСообщений;
		ГруппаОшибка = Элементы.ГруппаВходящиеСообщенияОшибкаВидыСообщений;
		ЭлементОбработаноВсего = Элементы.ВходящиеСообщенияОбработаноВсего;
		ЭлементКОбработкеВсего = Элементы.ВходящиеСообщенияКОбработкеВсего;
		ЭлементОшибкаВсего = Элементы.ВходящиеСообщенияОшибкаВсего;
		
	КонецЕсли;
	
	ОчиститьПодчиненныеЭлементы(ГруппаОбработано);
	ОчиститьПодчиненныеЭлементы(ГруппаКОбработке);
	ОчиститьПодчиненныеЭлементы(ГруппаОшибка);
	ЭлементОбработаноВсего.Заголовок = "<нет>";
	ЭлементКОбработкеВсего.Заголовок = "<нет>";
	ЭлементОшибкаВсего.Заголовок = "<нет>";

	Для Каждого Статус Из ПоСтатусам.Строки Цикл
		
		ИмяПеречисления = ИмяПеречисленияСтатусаОбработки(Статус.СтатусОбработки);
		
		Если Статус.СтатусОбработки = Перечисления.рдв_СтатусыОбработкиСообщений.Обработано Тогда
			ГруппаСтатуса = ГруппаОбработано;
			ЭлементВсего = ЭлементОбработаноВсего;
		ИначеЕсли Статус.СтатусОбработки = Перечисления.рдв_СтатусыОбработкиСообщений.КОбработке Тогда
			ГруппаСтатуса = ГруппаКОбработке;
			ЭлементВсего = ЭлементКОбработкеВсего;
		ИначеЕсли Статус.СтатусОбработки = Перечисления.рдв_СтатусыОбработкиСообщений.Ошибка Тогда
			ГруппаСтатуса = ГруппаОшибка;
			ЭлементВсего = ЭлементОшибкаВсего;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидСообщения Из Статус.Строки Цикл
			ДобавитьИнформациюПоВидуСообщения(ВидСообщения, ГруппаСтатуса, ИмяФормыОткрытия);
		КонецЦикла;
		
		Если Статус.Количество = 0 Тогда
			ЭлементВсего.Заголовок = "<нет>";
		Иначе
			ЭлементВсего.Заголовок = СтрШаблон("Всего (%1)", Статус.Количество);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементНаФорму(Запись, Родитель)

	ИмяЭлемента = СтрШаблон("%1_%2", Родитель.Имя, СтрЗаменить(Запись.ВидСообщения, ".", ""));
	ЗаголовокЭлемента = СтрШаблон("%1 (%2)", Запись.ВидСообщения, Запись.Количество);
	НовыйЭлемент = рдв_РаботаСФормами.ДобавитьПолеНадписи(ЭтотОбъект, ИмяЭлемента, ЗаголовокЭлемента, Родитель);
	НовыйЭлемент.Гиперссылка = Истина;
	рдв_РаботаСФормами.УстановитьДействие(НовыйЭлемент, "Нажатие", "ГиперссылкаНажатие");
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытиеОкнаНастроекФормы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиФормы = РезультатЗакрытия;
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастройкиФормы(Форма)
	
	НастройкиФормы = Форма.НастройкиФормы;
	
	НастройкиПоУмолчанию = Новый Структура("ВыводитьДанныеЗаПоследниеМинут,ИспользоватьАвтообновление,ПериодОбновления,ДатаНачала,ДатаНачалаМс");
	
	Если ТипЗнч(НастройкиФормы) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, НастройкиФормы);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиПоУмолчанию.ВыводитьДанныеЗаПоследниеМинут) Тогда
		НастройкиПоУмолчанию.ВыводитьДанныеЗаПоследниеМинут = 10080;
	КонецЕсли;
	Если НастройкиПоУмолчанию.ИспользоватьАвтообновление = Неопределено Тогда
		НастройкиПоУмолчанию.ИспользоватьАвтообновление = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НастройкиПоУмолчанию.ПериодОбновления) Тогда
		НастройкиПоУмолчанию.ПериодОбновления = 5;
	КонецЕсли;
	ТекущаяДата = ТекущаяДата();
	НастройкиПоУмолчанию.ДатаНачала = ТекущаяДата-(НастройкиПоУмолчанию.ВыводитьДанныеЗаПоследниеМинут * 60);
	ТекущаяДатаМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НастройкиПоУмолчанию.ДатаНачалаМс = ТекущаяДатаМс-(НастройкиПоУмолчанию.ВыводитьДанныеЗаПоследниеМинут * 60 * 1000);
	
	Возврат НастройкиПоУмолчанию;
	
КонецФункции

#КонецОбласти
